title: Process Network Connection
description: Detect inject the code of the Tor client in one of the processes
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    product: windows
    category: network_connection
detection:
    selection:
          Image|endswith: 
            - 'dllhost.exe'
            - 'regsvr32.exe'
            - 'rundll32.exe'
          Initiated: 'true'
          CommandLine:
            - ""
    condition: selection 
falsepositives:
    - Communication to other corporate systems that use IP addresses from public address spaces
level: medium

# Header.Type:"25" AND 
# (Payload.ParentImageFileName:"*\\rundll32.exe" OR Payload.ParentImageFileName:"*\\dllhost.exe" OR Payload.ParentImageFileName:"*\\regsrv32.exe")
# AND Payload.CommandLine:"" 
