title: Sysmon regitry modification event 
description: Set registry entry to enable its automatic execution
tags:
    - attack.execution
    - attack.persistence
logsource: 
    product: windows
    category: registry_set
detection:
    selection_1:
        TargetObject|contains:
            - '\Microsoft\Windows\CurrentVersion\Run\'  
            - '\Microsoft\Windows\CurrentVersion\RunOnceEx\'   
        Details|contains|all:
            - 'shell32'
            - 'ShellExec_RunDLLA'
            - '*REGSVR*'
    selection_2:
        TargetObject|contains:
            - 'Microsoft\Windows NT\CurrentVersion\ICM\Calibration' 
        Details|contains:
            - '\Temp\'
            - '.lnk'
    condition: 1 of selection_*
level: high

# в системе
# Header.Type:"30"
# AND ((Payload.KeyName:"*\\Microsoft\\Windows\\CurrentVersion\\Run*" OR Payload.KeyName: "*\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx*")
# AND (Payload.DataString:"*ShellExec_RunDLLA*" OR Payload.DataString:"*shell32*" OR Payload.DataString:"*REGSVR*"))
# OR (Payload.KeyName:"*\\Microsoft\\Windows NT\\CurrentVersion\\ICM\\Calibration*" AND 
# (Payload.DataString:"*\\Temp\\*" OR Payload.DataString:"*.lnk *")
