#https://github.com/SigmaHQ/sigma-specification/blob/main/Sigma_specification.md#level
#action: global - объединение нескольких правил в один документ / reset/repeat
title: CMSTP UAC Bypass via COM Object Access
#id: 
#status: experimental 
description: Detects UAC Bypass Attempt Using Microsoft Connection Manager Profile Installer Autoelevate-capable COM Objects (e.g. UACMe ID of 41, 43, 58 or 65)
#references: описание события
data: 2022/12/22
#author: 
#modified: дата последнего изменения
#tags: исп. namespace https://github.com/SigmaHQ/sigma-specification/blob/main/Tags_specification.md
tags:
# все до logsource, кроме title - не обязательно
logsource: 
    product: windows
    category: process_creation
    #definition: инфа в помощь по настройке для сбора событий (какой журнал, событие и т.д.)
detection:
    selection:
        ParentImage|endswith: '\DllHost.exe'
        IntegrityLevel:
            - 'High'
            - 'System'
        ParentCommandLine|contains:
            - ' /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}'
            - ' /Processid:{3E000D72-A845-4CD9-BD83-80C07C3B881F}'
            - ' /Processid:{BD54C901-076B-434E-B6C7-17C531F4AB41}'
            - ' /Processid:{D2E7041B-2927-42FB-8E9F-7CE93B6DC937}'
            - ' /Processid:{E9495B87-D950-4AB5-87A5-FF6D70BF3E90}'
    condition: selection
fields: #поля лога
    - CommandLine
    - ParentCommandLine
    - Hashes
falsepositives:
    - Legitimate CMSTP use (unlikely in modern enterprise environments)
level: high  #informational/low/medium/high/critical
#plsceholders

# cmd:
#ImagePath|re: '.*cmd.{0,5}(?:\/c|\/v).+(msiexec. | wmic.)"'